from telegram import ReplyKeyboardMarkup
from config import user_profiles, get_user_role


async def show_main_menu(update, context, has_profile=False):
    user_id = update.effective_user.id

    # Получаем роль пользователя
    current_role = get_user_role(user_id)

    if current_role == "teacher":
        keyboard = [
            ["👨‍🏫 Мой профиль", "📊 Панель управления"],
            ["📅 Заявки студентов", "🎓 Мои студенты"],
            ["💰 Управление балансом", "📋 Расписание"],
            ["✏️ Управление занятиями", "💬 Написать студенту"],
            ["🗑 Удалить студента", "🎂 Дни рождения"],  # Добавили кнопку удаления
            ["🛠 Техподдержка"]
        ]
        greeting = "👨‍🏫 Панель преподавателя"
    else:
        # Меню для студента
        if has_profile:
            keyboard = [
                ["👤 Мой профиль", "✏️ Изменить профиль"],
                ["📅 Выбрать расписание", "🕐 Мои занятия"],
                ["💰 Мой баланс", "👨‍🏫 Связаться с преподавателем"],
                ["🛠 Техподдержка"]
            ]
        else:
            keyboard = [
                ["👤 Создать профиль", "📅 Выбрать расписание"],
                ["🕐 Мои занятия", "👨‍🏫 Связаться с преподавателем"],
                ["🛠 Техподдержка"]
            ]
        greeting = "🎹 Главное меню музыкальной школы"

    reply_markup = ReplyKeyboardMarkup(keyboard, resize_keyboard=True)

    await update.message.reply_text(
        greeting,
        reply_markup=reply_markup
    )